In [1]:
import pandas as pd

In [2]:
url = 'http://bit.ly/uforeports'

In [3]:
df = pd.read_csv(url)

In [4]:
df.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [6]:
df.City

0                      Ithaca
1                 Willingboro
2                     Holyoke
3                     Abilene
4        New York Worlds Fair
                 ...
18236              Grant Park
18237             Spirit Lake
18238             Eagle River
18239             Eagle River
18240                    Ybor
Name: City, Length: 18241, dtype: object

In [7]:
df['City']

0                      Ithaca
1                 Willingboro
2                     Holyoke
3                     Abilene
4        New York Worlds Fair
                 ...
18236              Grant Park
18237             Spirit Lake
18238             Eagle River
18239             Eagle River
18240                    Ybor
Name: City, Length: 18241, dtype: object

In [9]:
type(df.City)

pandas.core.series.Series

In [12]:
df['Colors Reported']

0        NaN
1        NaN
2        NaN
3        NaN
4        NaN
        ...
18236    NaN
18237    NaN
18238    NaN
18239    RED
18240    NaN
Name: Colors Reported, Length: 18241, dtype: object

In [13]:
'ab' + 'cd'

'abcd'

In [14]:
'City' + 'State'

'CityState'

In [16]:
df['loc'] = df.City + ',' + df.State

In [17]:
df.head

<bound method NDFrame.head of                        City Colors Reported Shape Reported State  \
0                    Ithaca             NaN       TRIANGLE    NY
1               Willingboro             NaN          OTHER    NJ
2                   Holyoke             NaN           OVAL    CO
3                   Abilene             NaN           DISK    KS
4      New York Worlds Fair             NaN          LIGHT    NY
...                     ...             ...            ...   ...
18236            Grant Park             NaN       TRIANGLE    IL
18237           Spirit Lake             NaN           DISK    IA
18238           Eagle River             NaN            NaN    WI
18239           Eagle River             RED          LIGHT    WI
18240                  Ybor             NaN           OVAL    FL

                   Time                      loc
0        6/1/1930 22:00                Ithaca,NY
1       6/30/1930 20:00           Willingboro,NJ
2       2/15/1931 14:00               Holyoke,CO
3        6/1/1931 13:00               Abilene,KS
4       4/18/1933 19:00  New York Worlds Fair,NY
...                 ...                      ...
18236  12/31/2000 23:00            Grant Park,IL
18237  12/31/2000 23:00           Spirit Lake,IA
18238  12/31/2000 23:45           Eagle River,WI
18239  12/31/2000 23:45           Eagle River,WI
18240  12/31/2000 23:59                  Ybor,FL

[18241 rows x 6 columns]>

In [18]:
    df.describe()

,City,Colors Reported,Shape Reported,State,Time,loc
count,18216,2882,15597,18241,18241,18216
unique,6476,27,27,52,16145,8029
top,Seattle,RED,LIGHT,CA,11/16/1999 19:00,"Seattle,WA"
freq,187,780,2803,2529,27,187

In [20]:
df.shape

(18241, 6)

In [22]:
df.dtypes

City               object
Colors Reported    object
Shape Reported     object
State              object
Time               object
loc                object
dtype: object

In [23]:
df.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time', 'loc'], dtype='object')

In [29]:
df.rename(columns = {'City':'Sher', 'State':'Risayat'}, inplace = True)

In [30]:
df.columns

Index(['Sher', 'Colors Reported', 'Shape Reported', 'Risayat', 'Time', 'loc'], dtype='object')

In [32]:
df.drop('loc', axis = 1, inplace = True)

In [33]:
df.columns

Index(['Sher', 'Colors Reported', 'Shape Reported', 'Risayat', 'Time'], dtype='object')

In [35]:
rows = [5,6]
df.drop(rows, axis = 0, inplace = True)

In [36]:
df.head()

,Sher,Colors Reported,Shape Reported,Risayat,Time
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00
3,Abilene,NaN,DISK,KS,6/1/1931 13:00
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00

In [37]:
rows = [1,2]
df.drop(rows, axis = 0, inplace = True)

In [38]:
df.head()

,Sher,Colors Reported,Shape Reported,Risayat,Time
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00
3,Abilene,NaN,DISK,KS,6/1/1931 13:00
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00
7,Alma,NaN,DISK,MI,7/15/1936 0:00
8,Eklutna,NaN,CIGAR,AK,10/15/1936 17:00